vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC443_DFP.pdsc
    <condition id="allOf.component.lpuart_adapter, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="component.spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.spi, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.spi, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC443.internal_condition">
      <require condition="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm.internal_condition">
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.pit_adapter, driver.pit.internal_condition"/>
      <accept condition="allOf.component.tpm_adapter, driver.tpm.internal_condition"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.pit_adapter, driver.pit.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
    </condition>
    <condition id="allOf.component.tpm_adapter, driver.tpm.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
    </condition>
    <condition id="component.tpm_adapter.condition_id">
      <require condition="allOf.driver.tpm, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.uart, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXC443.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="device_id.MCXC443.internal_condition">
      <accept Dname="MCXC443VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXC443VMP" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device_id=MCXC443, driver.dma, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXC443, driver.dma, driver.dmamux.internal_condition">
      <require condition="device_id.MCXC443.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXC443.internal_condition">
      <require condition="device_id.MCXC443.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXC443.internal_condition">
      <accept Dname="MCXC443VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXC443VMP" Dvendor="NXP:11"/>
    </condition>
