vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC443_DFP.pdsc
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="driver.wm8962.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.driver.common, utility.debug_console, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="not.utility.assert.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="not.utility.assert.internal_condition">
      <deny Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, utility.str, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, utility.str, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_template_config.condition_id">
      <require condition="allOf.utility.debug_console, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.incbin.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.device=MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MCXC443.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MCXC443.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXC443.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=MCXC443.internal_condition"/>
    </condition>
