vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC443_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC443_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXC443_cmsis</description>
      <files>
        <file category="header" name="devices/MCXC443/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXC443/MCXC443.h" projectpath="device"/>
        <file category="header" name="devices/MCXC443/MCXC443_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXC443/MCXC443_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_CMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_DAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_DMAMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_FGPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_FTFA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_I2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_I2S.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_LLWU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_MCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_MCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_MTB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_MTBDWT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_NV.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_OSC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_PIT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_PMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_RCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_RFSYS.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_ROM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_SIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_SMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_SPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_TPM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_UART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC443/periph2/PERI_VREF.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXC443/"/>
        <file category="include" name="devices/MCXC443/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC443/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC443/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXC443_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXC443_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/arm/MCXC443_flash.scf" version="1.0.0" projectpath="MCXC443/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/arm/MCXC443_ram.scf" version="1.0.0" projectpath="MCXC443/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/gcc/MCXC443_flash.ld" version="1.0.0" projectpath="MCXC443/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/gcc/MCXC443_ram.ld" version="1.0.0" projectpath="MCXC443/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/iar/MCXC443_flash.icf" version="1.0.0" projectpath="MCXC443/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC443.condition_id" category="linkerScript" attr="config" name="devices/MCXC443/iar/MCXC443_ram.icf" version="1.0.0" projectpath="MCXC443/iar"/>
      </files>
    </component>
