vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC443_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_ftp12557" Cversion="1.0.0" condition="driver.slcd_ftp12557.condition_id">
      <description>Driver slcd_ftp12557</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_FTP12557_H
#define SLCD_PANEL_FTP12557_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/FTP12557/FTP12557.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/FTP12557/FTP12557.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/FTP12557/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_gdh_1247wp" Cversion="1.0.1" condition="driver.slcd_gdh_1247wp.condition_id">
      <description>Driver slcd_gdh_1247wp</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_GDH_1247WP_H
#define SLCD_PANEL_GDH_1247WP_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/GDH-1247WP/GDH-1247WP.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/GDH-1247WP/GDH-1247WP.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/GDH-1247WP/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr" Cversion="1.0.2" condition="driver.slcd_lcd_s401m16kr.condition_id">
      <description>Driver slcd_lcd_s401m16kr</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_LCD_S401M16KR_H
#define SLCD_PANEL_LCD_S401M16KR_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/LCD-S401M16KR/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_od_6010" Cversion="1.0.0" condition="driver.slcd_od_6010.condition_id">
      <description>Driver slcd_od_6010</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_OD_6010_H
#define SLCD_PANEL_OD_6010_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/OD-6010/OD-6010.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/OD-6010/OD-6010.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/OD-6010/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smc" Cversion="2.0.7" condition="driver.smc.condition_id">
      <description>SMC Driver</description>
      <files>
        <file category="header" name="devices/MCXC443/drivers/fsl_smc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC443/drivers/fsl_smc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC443/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.1.4" condition="driver.spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="header" name="devices/MCXC443/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC443/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC443/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.1.1" condition="driver.spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="header" name="devices/MCXC443/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC443/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC443/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896" Cversion="6.0.2" condition="driver.tfa9896.condition_id">
      <description>Driver tfa9896</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9896_ENABLE
#define CODEC_TFA9896_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896_buffer.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_hal_registers.c" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_tfa9896.c" projectpath="codec"/>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896.h" projectpath="codec"/>
        <file category="doc" name="components/codec/tfa9896/MIMXRT595595-EVK_TFA9896_SW.pdf" projectpath="codec"/>
        <file category="include" name="components/codec/tfa9896/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx" Cversion="2.1.0" condition="driver.tfa9xxx.condition_id">
      <description>Driver tfa9xxx</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9XXX_ENABLE
#define CODEC_TFA9XXX_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9892N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N2.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx.c" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/fsl_tfa9xxx.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx_IMX.c" projectpath="codec/tfa9xxx"/>
        <file category="doc" name="components/codec/tfa9xxx/README.md" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/config.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dsp_fw.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_init.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa9xxx_parameters.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_container_crc32.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_haptic_fw_defs.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="include" name="components/codec/tfa9xxx/"/>
        <file category="include" name="components/codec/tfa9xxx/vas_tfa_drv/"/>
      </files>
    </component>
